# wsEditAddTool

## Description
Add a menu under Third-party palette and companyName tool set.

```pascal
PROCEDURE wsEditAddTool(
				toolName : STRING;
				toolType : INTEGER);
```

```python

def vs.wsEditAddTool(toolName, toolType):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|toolName|STRING||
|toolType|INTEGER||

## Version
Availability: from Vectorworks 2018
## Category
* Workspaces